/*
    输出二维数组的有关数据（地址和元素的值）
*/

#include <stdio.h>

void main()

{
    int a[3][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};

    printf("a        : %d\n", a); // 0行起始地址

    printf("&a[0]    : %d\n", &a[0]); // 0行起始地址

    printf("*a       : %d\na[0]     : %d\n*(a +0)  : %d\n", *a, a[0], *(a + 0)); // 0行0列元素地址

    printf("&a[0][0] : %d\n", &a[0][0]); // 0行0列元素地址

    printf("a + 1       : %d\n", a + 1); // 1行起始地址

    printf("a[1]        : %d\n&a[1][0]    : %d\n", a[1], &a[1][0]); // 1行0列元素地址

    printf("*(a +1) + 0 : %d\n", *(a + 1) + 0); // 1行0列元素地址

    printf("a[1][0]         : %d\n*(*(a + 1) + 0) : %d\n", a[1][0], *(*(a + 1) + 0)); // 1行0列元素地址

    printf("&a[2]    : %d\na + 2    : %d\n", &a[2], a + 2); // 2行起始地址

    printf("a[2]     : %d\n*(a + 2) : %d\n", a[2], *(a + 2)); // 2行0列元素起始地址

    printf("*a[2]           : %d\n*(*(a + 2) + 0) : %d\n", *a[2], *(*(a + 2) + 0)); // 2行0列元素起始地址
}
