/*
    有一个指针数组，其元素分别指向一个整型数组的元素，
    用指向指针数据的指针变量，输出整型数组各元素的值。
*/

#include <stdio.h>

int main()
{
    int a[5] = {1, 3, 5, 7, 9};
    int *num[] = {&a[0], &a[1], &a[2], &a[3], &a[4]};  // 指针数组的元素只能存放地址，不能存放数
    int **p, i; // p是指向指针型数据的指针变量

    p = num; // 使p指向 num[0]

    for (i = 0; i < 5; i++)
    {
        printf("%d  ", *p); // *p表示&a[0](即a[0]的地址)
        //printf ("%-3d" , **p) ; // *p表示&a[0](即a[0]的地址) ，**p表示取a[0]地址存放的值
        p++;  // 因为a为整型，所以每个地址+4
    }
    printf("\n");

    p = num; // 对p初始化，使p指向 num[0]

    for (i = 0; i < 5; i++)
    {
        //printf ("%d" , *p) ;
        printf("%-3d", **p); // *p表示&a[0](即a[0]的地址) ，**p表示取a[0]地址存放的值
        p++;
    }
    printf("\n");

    return 0;
}